In [1]:
import numpy as np
import petl as etl
import pandas as pd

second column is engine size , third column is hp

https://www.kaggle.com/toramky/automobile-dataset

In [2]:
cars = np.array([('audi', 109, 102), 
                 ('bmw', 108, 101),
                 ('chevrolet', 61, 48)],
                  dtype='U8, i4, i4')

In [3]:
cars_table = etl.fromarray(cars)

In [8]:
cars_table

+------------+-----+-----+
| f0         | f1  | f2  |
+============+=====+=====+
| 'audi'     | 109 | 102 |
+------------+-----+-----+
| 'bmw'      | 108 | 101 |
+------------+-----+-----+
| 'chevrole' | 61  | 48  |
+------------+-----+-----+

In [10]:
cars_table = etl.setheader(cars_table, ['Brand', 'Engine Size', 'Horse Power'])

cars_table

+------------+-------------+-------------+
| Brand      | Engine Size | Horse Power |
+============+=============+=============+
| 'audi'     | 109         | 102         |
+------------+-------------+-------------+
| 'bmw'      | 108         | 101         |
+------------+-------------+-------------+
| 'chevrole' | 61          | 48          |
+------------+-------------+-------------+

Load data from the given table into a numpy structured array

In [11]:
car_array = etl.toarray(cars_table)

In [12]:
car_array

array([('audi', 109, 102), ('bmw', 108, 101), ('chevrole',  61,  48)],
      dtype=(numpy.record, [('Brand', '<U8'), ('Engine Size', '<i4'), ('Horse Power', '<i4')]))

### DataFrames (pandas)

https://www.kaggle.com/gauravsharma99/car-mpg/notebooks

In [13]:
df = pd.read_csv('./datasets/mpg.csv')

In [14]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [15]:
mpg = etl.fromdataframe(df)

In [17]:
mpg.display()

mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [18]:
mpg.nrows()

398

Count the number of values found for each Python type

In [19]:
etl.typecounter(mpg, 'name')

Counter({'str': 398})

Count the number of values found for each Python type and return a table mapping class names to counts and frequencies.

In [20]:
etl.typecounts(mpg, 'horsepower')

+---------+-------+-----------+
| type    | count | frequency |
+=========+=======+===========+
| 'float' |   398 |       1.0 |
+---------+-------+-----------+

In [21]:
cars_table

+------------+-------------+-------------+
| Brand      | Engine Size | Horse Power |
+============+=============+=============+
| 'audi'     | 109         | 102         |
+------------+-------------+-------------+
| 'bmw'      | 108         | 101         |
+------------+-------------+-------------+
| 'chevrole' | 61          | 48          |
+------------+-------------+-------------+

Load data from the given table into a pandas DataFrame

In [22]:
car_df = etl.todataframe(cars_table)

In [23]:
car_df.head()

      Brand  Engine Size  Horse Power
0      audi          109          102
1       bmw          108          101
2  chevrole           61           48